Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/atdf/PIC32MZ1025DAS169.atdf
      <value-group caption="EBIRDYx Pin Sensitivity Control bit" name="CFGEBIC__EBIRDYLVL">
         <value caption="Use level detect for EBIRDYx pins" name="" value="0x1" />
         <value caption="Use edge detect for EBIRDYx pins" name="" value="0x0" />
      </value-group>
      <value-group caption="EBIRDY1 Pin Enable bit" name="CFGEBIC__EBIRDYEN1">
         <value caption="EBIRDY1 pin is enabled for use by the EBI module" name="" value="0x1" />
         <value caption="EBIRDY1 pin is available for general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBIRDY2 Pin Enable bit" name="CFGEBIC__EBIRDYEN2">
         <value caption="EBIRDY2 pin is enabled for use by the EBI module" name="" value="0x1" />
         <value caption="EBIRDY2 pin is available for general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBIRDY3 Pin Enable bit" name="CFGEBIC__EBIRDYEN3">
         <value caption="EBIRDY3 pin is enabled for use by the EBI module" name="" value="0x1" />
         <value caption="EBIRDY3 pin is available for general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBIRDY1 Inversion Control bit" name="CFGEBIC__EBIRDYINV1">
         <value caption="Invert EBIRDY1 pin before use" name="" value="0x1" />
         <value caption="Do not invert EBIRDY1 pin before use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBIRDY2 Inversion Control bit" name="CFGEBIC__EBIRDYINV2">
         <value caption="Invert EBIRDY2 pin before use" name="" value="0x1" />
         <value caption="Do not invert EBIRDY2 pin before use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBIRDY3 Inversion Control bit" name="CFGEBIC__EBIRDYINV3">
         <value caption="Invert EBIRDY3 pin before use" name="" value="0x1" />
         <value caption="Do not invert EBIRDY3 pin before use" name="" value="0x0" />
      </value-group>
      <value-group caption="CPU Permission Group bits" name="CFGPG__CPUPG">
         <value caption="Initiator is assigned to Permission Group 3" name="" value="0x3" />
         <value caption="Initiator is assigned to Permission Group 2" name="" value="0x2" />
         <value caption="Initiator is assigned to Permission Group 1" name="" value="0x1" />
         <value caption="Initiator is assigned to Permission Group 0" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Module Permission Group bits" name="CFGPG__DMAPG">
         <value caption="Initiator is assigned to Permission Group 3" name="" value="0x3" />
         <value caption="Initiator is assigned to Permission Group 2" name="" value="0x2" />
         <value caption="Initiator is assigned to Permission Group 1" name="" value="0x1" />
         <value caption="Initiator is assigned to Permission Group 0" name="" value="0x0" />
      </value-group>
      <value-group caption="USB Module Permission Group bits" name="CFGPG__USBPG">
         <value caption="Initiator is assigned to Permission Group 3" name="" value="0x3" />
         <value caption="Initiator is assigned to Permission Group 2" name="" value="0x2" />
         <value caption="Initiator is assigned to Permission Group 1" name="" value="0x1" />
         <value caption="Initiator is assigned to Permission Group 0" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN1 Module Permission Group bits" name="CFGPG__CAN1PG">
         <value caption="Initiator is assigned to Permission Group 3" name="" value="0x3" />
         <value caption="Initiator is assigned to Permission Group 2" name="" value="0x2" />
         <value caption="Initiator is assigned to Permission Group 1" name="" value="0x1" />
         <value caption="Initiator is assigned to Permission Group 0" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN2 Module Permission Group bits" name="CFGPG__CAN2PG">
         <value caption="Initiator is assigned to Permission Group 3" name="" value="0x3" />
         <value caption="Initiator is assigned to Permission Group 2" name="" value="0x2" />
         <value caption="Initiator is assigned to Permission Group 1" name="" value="0x1" />
         <value caption="Initiator is assigned to Permission Group 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Ethernet Module Permission Group bits" name="CFGPG__ETHPG">
         <value caption="Initiator is assigned to Permission Group 3" name="" value="0x3" />
         <value caption="Initiator is assigned to Permission Group 2" name="" value="0x2" />
         <value caption="Initiator is assigned to Permission Group 1" name="" value="0x1" />
         <value caption="Initiator is assigned to Permission Group 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Secure Digital Host Controller Permission Group bits" name="CFGPG__SDHCPG">
         <value caption="Initiator is assigned to Permission Group 3" name="" value="0x3" />
         <value caption="Initiator is assigned to Permission Group 2" name="" value="0x2" />
         <value caption="Initiator is assigned to Permission Group 1" name="" value="0x1" />
         <value caption="Initiator is assigned to Permission Group 0" name="" value="0x0" />
      </value-group>
      <value-group caption="SQI Module Permission Group bits" name="CFGPG__SQI1PG">
         <value caption="Initiator is assigned to Permission Group 3" name="" value="0x3" />
         <value caption="Initiator is assigned to Permission Group 2" name="" value="0x2" />
         <value caption="Initiator is assigned to Permission Group 1" name="" value="0x1" />
         <value caption="Initiator is assigned to Permission Group 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Flash Control Permission Group bits" name="CFGPG__FCPG">
         <value caption="Initiator is assigned to Permission Group 3" name="" value="0x3" />
         <value caption="Initiator is assigned to Permission Group 2" name="" value="0x2" />
         <value caption="Initiator is assigned to Permission Group 1" name="" value="0x1" />
         <value caption="Initiator is assigned to Permission Group 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Crypto Engine Permission Group bits" name="CFGPG__CRYPTPG">
         <value caption="Initiator is assigned to Permission Group 3" name="" value="0x3" />
         <value caption="Initiator is assigned to Permission Group 2" name="" value="0x2" />
         <value caption="Initiator is assigned to Permission Group 1" name="" value="0x1" />
         <value caption="Initiator is assigned to Permission Group 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Graphics LCD Controller Permission Group bits" name="CFGPG__GLCDPG">
         <value caption="Initiator is assigned to Permission Group 3" name="" value="0x3" />
         <value caption="Initiator is assigned to Permission Group 2" name="" value="0x2" />
         <value caption="Initiator is assigned to Permission Group 1" name="" value="0x1" />
         <value caption="Initiator is assigned to Permission Group 0" name="" value="0x0" />
      </value-group>
      <value-group caption="2D Graphics Processing Unit Permission Group bits" name="CFGPG__GPUPG">
         <value caption="Initiator is assigned to Permission Group 3" name="" value="0x3" />
         <value caption="Initiator is assigned to Permission Group 2" name="" value="0x2" />
         <value caption="Initiator is assigned to Permission Group 1" name="" value="0x1" />
         <value caption="Initiator is assigned to Permission Group 0" name="" value="0x0" />
      </value-group>
      <value-group caption="GPU Reset Bit" name="CFGCON2__GPURESET">
         <value caption="Hold GPU in RESET" name="" value="0x1" />
         <value caption="Release RESET to the GPU module" name="" value="0x0" />
      </value-group>
      <value-group caption="SD card Write Protect Polarity bit" name="CFGCON2__SDWPPOL">
         <value caption="SDWP pin is Active-High" name="" value="0x1" />
         <value caption="SDWP pin is Active-Low" name="" value="0x0" />
      </value-group>
      <value-group caption="SD card Write Protect Enable bit" name="CFGCON2__SDWPEN">
         <value caption="SDWP pin is enabled for use by SDHC" name="" value="0x1" />
         <value caption="SDWP pin is available for general purpose use" name="" value="0x0" />
      </value-group>
      <value-group caption="SD Card Detect Pin Enable bit" name="CFGCON2__SDCDEN">
         <value caption="SDCD pin is enabled for use by SDHC" name="" value="0x1" />
         <value caption="SDCD pin is available for general purpose use" name="" value="0x0" />
      </value-group>
