Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/atdf/PIC32MZ1025DAS169.atdf
      <value-group caption="Channel Busy bit" name="DCH1CON__CHBUSY">
         <value caption="Channel is active or has been enabled" name="" value="0x1" />
         <value caption="Channel is inactive or has been disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Priority bits" name="DCH2CON__CHPRI">
         <value caption="Channel has priority 3 (highest)" name="CHPRI3" value="0x3" />
         <value caption="Channel has priority 2" name="CHPRI2" value="0x2" />
         <value caption="Channel has priority 1" name="CHPRI1" value="0x1" />
         <value caption="Channel has priority 0" name="CHPRI0" value="0x0" />
      </value-group>
      <value-group caption="Channel Event Detected bit" name="DCH2CON__CHEDET">
         <value caption="An event has been detected" name="" value="0x1" />
         <value caption="No events have been detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Automatic Enable bit" name="DCH2CON__CHAEN">
         <value caption="Channel is continuously enabled" name="" value="0x1" />
         <value caption="Channel is disabled on block transfer complete" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Chain Enable bit" name="DCH2CON__CHCHN">
         <value caption="Allow channel to be chained" name="" value="0x1" />
         <value caption="Do not allow channel to be chained" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Allow Events If Disabled bit" name="DCH2CON__CHAED">
         <value caption="Channel start/abort events will be registered" name="" value="0x1" />
         <value caption="Channel start/abort events will be ignored if the channel is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Enable bit" name="DCH2CON__CHEN">
         <value caption="Channel is enabled" name="" value="0x1" />
         <value caption="Channel is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Chain Channel Selection bit" name="DCH2CON__CHCHNS">
         <value caption="Chain to channel lower in natural priority (CH1 will be enabled by CH2 transfer complete)" name="" value="0x1" />
         <value caption="Chain to channel higher in natural priority (CH1 will be enabled by CH0 transfer complete)" name="" value="0x0" />
      </value-group>
      <value-group caption="Pattern Length bit" name="DCH2CON__CHPATLEN">
         <value caption="2 byte length" name="" value="0x1" />
         <value caption="1 byte length" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Pattern Ignore Byte bit" name="DCH2CON__CHPIGNEN">
         <value caption="Treat any byte that matches the CHPIGN bits as a dont care when pattern matching is enabled" name="" value="0x1" />
         <value caption="Disable this feature" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Busy bit" name="DCH2CON__CHBUSY">
         <value caption="Channel is active or has been enabled" name="" value="0x1" />
         <value caption="Channel is inactive or has been disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Priority bits" name="DCH3CON__CHPRI">
         <value caption="Channel has priority 3 (highest)" name="CHPRI3" value="0x3" />
         <value caption="Channel has priority 2" name="CHPRI2" value="0x2" />
         <value caption="Channel has priority 1" name="CHPRI1" value="0x1" />
         <value caption="Channel has priority 0" name="CHPRI0" value="0x0" />
      </value-group>
      <value-group caption="Channel Event Detected bit" name="DCH3CON__CHEDET">
         <value caption="An event has been detected" name="" value="0x1" />
         <value caption="No events have been detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Automatic Enable bit" name="DCH3CON__CHAEN">
         <value caption="Channel is continuously enabled" name="" value="0x1" />
         <value caption="Channel is disabled on block transfer complete" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Chain Enable bit" name="DCH3CON__CHCHN">
         <value caption="Allow channel to be chained" name="" value="0x1" />
         <value caption="Do not allow channel to be chained" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Allow Events If Disabled bit" name="DCH3CON__CHAED">
         <value caption="Channel start/abort events will be registered" name="" value="0x1" />
         <value caption="Channel start/abort events will be ignored if the channel is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Enable bit" name="DCH3CON__CHEN">
         <value caption="Channel is enabled" name="" value="0x1" />
         <value caption="Channel is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Chain Channel Selection bit" name="DCH3CON__CHCHNS">
         <value caption="Chain to channel lower in natural priority (CH1 will be enabled by CH2 transfer complete)" name="" value="0x1" />
         <value caption="Chain to channel higher in natural priority (CH1 will be enabled by CH0 transfer complete)" name="" value="0x0" />
      </value-group>
      <value-group caption="Pattern Length bit" name="DCH3CON__CHPATLEN">
         <value caption="2 byte length" name="" value="0x1" />
         <value caption="1 byte length" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Pattern Ignore Byte bit" name="DCH3CON__CHPIGNEN">
         <value caption="Treat any byte that matches the CHPIGN bits as a dont care when pattern matching is enabled" name="" value="0x1" />
         <value caption="Disable this feature" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Busy bit" name="DCH3CON__CHBUSY">
         <value caption="Channel is active or has been enabled" name="" value="0x1" />
         <value caption="Channel is inactive or has been disabled" name="" value="0x0" />
      </value-group>
